---
kind: method
id: M:Autodesk.Revit.DB.DisplacementPath.IsValidParam(System.Double)
source: html/2e1abd7d-718e-26af-7fbc-6746ec2963c2.htm
---
# Autodesk.Revit.DB.DisplacementPath.IsValidParam Method

Is the specified value a valid edge or curve parameter.

## Syntax (C#)
```csharp
public static bool IsValidParam(
	double param
)
```

## Parameters
- **param** (`System.Double`) - proposed edge parameter.